; Следующая процедура вычисляет математическую функцию, называемую функцией Аккермана.
(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1)
                 (A x (- y 1))))))
; Каковы значения следующих выражений?
(A 1 10)
(A 2 4)
(A 3 3)

; Рассмотрим следующие процедуры, где A — процедура, определенная выше: 
(define (f n) (A 0 n))
(define (g n) (A 1 n))
(define (h n) (A 2 n))
(define (k n) (* 5 n n))
; Дайте краткие математические определения функций, вычисляемых процедурами f, g и h для
; положительных целых значений n. Например, (k n) вычисляет 5n2 .

; см определение
(f n) = (A 0 n) = 2*n.

(A 1 10)
(A 1 10) 
(A 0 (A 1 9)) 
(A 0 (A 0 (A 1 8))) 
... 
(A 0 (A 0 (... (A 0 (A 0 (A 1 1))) ...))) 
(A 0 (A 0 (... (A 0 (A 0 2)) ...))) 
(A 0 (A 0 (... (A 0 (* 2 2)) ...))) 
(A 0 (A 0 (... (A 0 4) ...))) 
... 
(A 0 (A 0 2^8)) 
(A 0 (* 2 2^8)) 
(A 0 2^9) 
2^10 
1024
=> (define (g n) (A 1 n)) = 2^n, n > 0
(g 0) = 0

(A 2 4)
(A 1 (A 2 3))
(A 1 (A 1 (A 2 2))) 
(A 1 (A 1 (A 1 (A 2 1)))) 
(A 1 (A 1 (A 1 2)))
… (см (A 1 10)
(A 1 (A 1 2^2=4))
(A 1 2^4=16)
2^16 = 65536
...
2^2^2^2 = 2^2^4 = 2^16 = 65536

=> (define (h n) (A 2 n)) = 2^2^..^2, n > 0
(h 0) = 0.

(A 3 3)
(A 3 3) 
(A 2 (A 3 2)) 
(A 2 (A 2 (A 3 1))) 
(A 2 (A 2 2)) 
... 
(A 2 2^2) 
(A 2 4) 
... 
2^2^2^2 = 65536